Autodesk.Revit.UI.ColorSelectionDialog.Show
Shows the Revit Color dialog as a modal dialog.
Returns:
A status indicating whether the user selected a color or cancelled the dialog without making a selection.
Since:
2017

Autodesk.Revit.UI.ColorSelectionDialog.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ColorSelectionDialog.OriginalColor
The original color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.ColorSelectionDialog.SelectedColor
The new color selected by the user.
Since:
2017

Autodesk.Revit.UI.ColorSelectionDialog.#ctor
Default constructor.
Since:
2017

Autodesk.Revit.UI.ColorSelectionDialog
Allows display of the Revit Color dialog.
Remarks:
The class provides the option to launch the Revit Color dialog to select the color.
Since:
2017